{
  "featuredNews": {
    "id": 1,
    "title": "Підписано договір про співпрацю з провідними IT-компаніями",
    "date": "2025-05-15",
    "content": "Кафедра ПЗАС ЧДТУ уклала стратегічне партнерство з ключовими IT-компаніями регіону. Ця угода відкриває нові горизонти для студентів: стажування, спільні проєкти та залучення експертів до навчального процесу. Ми прагнемо забезпечити наших випускників найкращими кар'єрними можливостями та актуальними знаннями.",
    "image": "/img-main-page/news/photo_news_1.png",
    "link": "/articlePage.html?id=1",
    "fullArticle": "html-page/articles/featured-1.html"
  },
  "latestNews": [
    {
      "id": 2,
      "title": "Студенти нашої кафедри перемогли на IT-Олімпіаді",
      "date": "2025-05-10",
      "content": "Команда студентів кафедри Програмного забезпечення автоматизованих систем здобула блискучу перемогу на Всеукраїнській IT-Олімпіаді з програмування. Учасники продемонстрували високий рівень підготовки та інноваційний підхід до вирішення складних завдань. Вітаємо переможців та їхніх наставників!",
      "image": "/img-main-page/news/photo_news_2.png",
      "link": "/articlePage.html?id=2",
      "fullArticle": "html-page/articles/news-2.html"
    },
    {
      "id": 3,
      "title": "Оновлено програму курсу 'Штучний інтелект'",
      "date": "2025-05-08",
      "content": "З нового навчального року студенти кафедри вивчатимуть оновлену програму курсу 'Штучний інтелект та машинне навчання'. Додано актуальні теми з глибокого навчання, обробки природної мови та комп'ютерного зору. Курс розроблено з урахуванням останніх тенденцій та вимог ринку праці.",
      "image": "/img-main-page/news/photo_news_3.png",
      "link": "/articlePage.html?id=3",
      "fullArticle": "html-page/articles/news-3.html"
    },
    {
      "id": 4,
      "title": "Відкрито реєстрацію на літню школу програмування",
      "date": "2025-05-05",
      "content": "Кафедра ПЗАС запрошує учнів старших класів та студентів молодших курсів на щорічну Літню школу програмування! У програмі: інтенсивні заняття з Python, веб-розробки та основ кібербезпеки. Найкращі учасники отримають цінні призи та можливість долучитися до проєктів кафедри.",
      "image": "/img-main-page/news/photo_news_1.png",
      "link": "/articlePage.html?id=4",
      "fullArticle": "html-page/articles/news-4.html"
    },
    {
      "id": 5,
      "title": "Відбудеться гостьова лекція від провідного спеціаліста Google",
      "date": "2025-04-25",
      "content": "Запрошуємо всіх охочих на унікальну гостьову лекцію від провідного інженера компанії Google, пана Олексія Іванова. Тема лекції: 'Майбутнє хмарних технологій та їх вплив на розробку програмного забезпечення'. Не пропустіть можливість дізнатися про інсайди галузі від світового експерта!",
      "image": "/img-main-page/news/photo_news_2.png",
      "link": "/articlePage.html?id=5",
      "fullArticle": "html-page/articles/news-5.html"
    },
    {
      "id": 6,
      "title": "Студентам доступні нові можливості стажування в IT-компаніях",
      "date": "2025-04-20",
      "content": "Завдяки розширенню партнерської мережі, студенти кафедри ПЗАС отримали доступ до нових програм стажування у провідних IT-компаніях України та за кордоном. Це чудова можливість отримати практичний досвід, працюючи над реальними проєктами та навчаючись у найкращих фахівців.",
      "image": "/img-main-page/news/photo_news_3.png",
      "link": "/articlePage.html?id=6",
      "fullArticle": "html-page/articles/news-6.html"
    },
    {
      "id": 7,
      "title": "Відкрито нову лабораторію з робототехніки",
      "date": "2025-04-15",
      "content": "На базі кафедри ПЗАС відбулося урочисте відкриття сучасної лабораторії з робототехніки та Інтернету речей (IoT). Лабораторія оснащена новітнім обладнанням, що дозволить студентам реалізовувати амбітні проєкти та проводити дослідження на світовому рівні.",
      "image": "/img-main-page/news/photo_news_1.png",
      "link": "/articlePage.html?id=7",
      "fullArticle": "html-page/articles/news-7.html"
    },
    {
      "id": 8,
      "title": "Зустріч з випускниками кафедри",
      "date": "2025-04-10",
      "content": "Відбулася тепла та продуктивна зустріч студентів та викладачів кафедри ПЗАС з успішними випускниками минулих років. Наші випускники поділилися своїм досвідом роботи в IT-сфері, дали цінні поради майбутнім фахівцям та обговорили можливості співпраці.",
      "image": "/img-main-page/news/photo_news_2.png",
      "link": "/articlePage.html?id=8",
      "fullArticle": "html-page/articles/news-8.html"
    }
  ]
}